{
    "experience" : "Experience",
    "projects" : "Projects",
    "aboutme" : "About me",
    "aboutme-ph1" : "I'm a second year student scolarized at ENSIMAG, an Engineering school based in Grenoble, France. My courses are mainly related to 3D modelisation, simulation and vision graphics.",
    "aboutme-ph2" : "When I'm not in school, I enjoy working on projects that challenge my intellect. Especially when it comes to art, computer sciences or mathematics, I'm very curious and eager to learn new things, even new fields that are completely unfamiliar to me.",
    "aboutme-ph3" : "Lately I've worked a little bit on web development with the building of this website and I've also managed to create a raycaster in C. As of now, I'm currently learning GLSL on my own so that I can create my own shaders. I'm also learning Rust and OpenGL as I'm planning to create a 3D multiplayer game totally from scratch (including the game engine) with two friends starting in February 2023 (school project chosen by us). My experience in GLSL combined with OpenGL will allow me to create and incorporate my own shaders into the game.",
    "aboutme-ph4": "When I'm not programming, you'll probably find me climbing on walls or rocks with my friends (there are pretty good climbing spots here in Grenoble!). I also have a deep interest in drawing and music as well as video games (I mostly play Terraria, I love this game!). Don't hesitate to check the Education section if you're interested!",
    "contact" : "Want to get in touch? Don't hesitate to contact me!",



    "schooling" : "Education",
    "location1":"Graduate School of Engineering in Applied mathematics and Computer Science, Grenoble, France",
    "timeline1" : "Since September 2021",
    "diploma1" : "Engineering degree in computer sciences",
    "description1-1" : "Three-years engineering school in computer sciences and applied mathematics based in Grenoble.",
    "description1-2" : "Specialty : 3D modelisation, simulation, rendering and vision graphics.",

    "diploma2" : "Pre-engineering preparation in maths, physics, computer science for the entrance to French “Grandes Ecoles\" ",
    "timeline2" : "September 2019 - June 2021",
    "location2":"Grenoble, France",
    "ranking" : "Ranking : 1st place over ~420 students",
    "description2" : "Preparatory classes : two-year undergraduate intensive courses mainly related to mathematics, physics and chemistry.",

    "location3":"High School in Grenoble, France",
    "timeline3" : "September 2016 - June 2019",
    "diploma3" : "French High School Diploma (Baccalauréat) awarded with highest honours (19,18/20)",
    "description3-1" : "Courses mainly related to sciences (mathematics, physics, chemistry and biology).",
    "description3-2" : "Second-year project on how to improve the flight of paper planes.",

    "other-education" : "Hobbies",

    "title4" : "Self-teaching of the guitar",
    "timeline4" : "Since 2018",
    "description4-1" : " Learning of the guitar by following courses on youtube.",
    "description4-2" : "No performance on stage to this day...",

    "location5" : "Meylan's Academy of music",
    "timeline5" : "2007-2017",
    "diploma5" : "Certificate in music studies (instrument : clarinet)",
    "description5-1" : "Practices in clarinet, courses in music theory.",
    "description5-2" : "Around 2015 I joined an orchestra called Bo.Per.Cui which gave me many opportunities to perform on stage (in France and Germany). It was a really fun experience as I got to meet new wonderful people and to discover a different culture. ",

    "title6":"Drawing",
    "timeline6":"Since I could hold a pencil!",
    "description6-1":"Here are some of the drawings I've made in the last years. I only use pencils with different graphite according to the level of precision that I need (shadow, facial features...).",
    "description6-2":"I've learned to draw by myself when I was little mostly by repoducing pictures that I had taken or by trying to draw objects in my room. As long as I remember, I've always liked the idea of repoducing reality in its tiniest details.",
    "description6-3":"As I grew up, I started inventing characters and draw them (some of the faces below are probably unconsciously a mix of the people I see in my everyday life).",

    "pro-experiences" : "Professional experiences",

    "job1" : "Seller",
    "job-timeline1" : "18 July 2022 - 8 August 2022 (3 weeks)",
    "job-location1":"IKEA, Grenoble, France",
    "job-description1-1" : "First real professionnal experience in a multinational corporation." ,
    "job-description1-2" : "My main job was to handling all the clients' resquests.",
    "job-description1-3" : "Then, I had to handle the restocking and the maintenance of the sections (plants' watering, shelves' tidying...).",
    "job-description1-4" : "This job really helped me gain in confidence in front of people as I had to take initiatives by myself in front of the clients, express myself correctly. It taught me how to be reponsible at work and how to behave well in a corporation, as much with my colleagues as with the clients.",

    "job2" : "Tutor",
    "job-timeline2" : "November 2021 - Mars 2022 (4 months)",
    "job-location2" : "La Prépa des INP, Saint-Martin-d'Hères, France",
    "job-description2-1" : "Dispense of courses related to mathematics, physics and chemistry to two first-year students of la Prépa in difficulties in these classes.",
    "job-description2-2" : "Each course was divided in several key moments. At the beginning, the students could ask questions about particular difficulties in their classes or in their work organisation. It allowed me to prepare the content of the next classes. After that, the rest of the class was about revisions of the current lesson and exercises that I had prepared before then.",

    "job3" : "Internship",
    "job-timeline3" : "May 2021 - June 2021 (6 weeks) ",
    "job-location3" : "LDLC, Saint-Martin-d'Hères, France", 
    "job-description3-1" : "Worker internship required for the end of my preparatory classes.",
    "job-description3-2" : "Computer set-ups (installation of Windows OS, assembly of the different components of the computer's architecture).",
    "job-description3-3" : "Handling of clients in the shop (cashing, online orders, click and collect...). Restocking (packages recetion, placement in the shop...).",
    "job-description3-4" : "Update of certains parts of the company's inventory.",

    "job5" : "Engineer assistant",
    "job-timeline5":"22 September 2022 - 31 December 2022 (3 months)",
    "job-location5" : "Grenoble Informatics Laboratory (LIG), France", 
    "job-description5-1":"Research study consisting of making a state-of-the-art of nudges in the digital domain which aim for reducing the environmental impact related to ICT (Information and Communication Technology).",
    "job-description5-2":"This job taught me the ability to find quickly relevant information in the scientific literature (articles, papers) using various resources (ACM, Sci-lab, Research Gate, etc.).",
    "job-description5-3":"I also had the opportunity to learn how to write a file in Markdown and how to use Obsidian.",


    "other-experiences" : "Other type(s) of experience(s)",
    "job4" : "Young town councillor",
    "job-timeline4" : "2010 - 2012 (2 years)",
    "job-location4" : "Meylan's town hall, France",
    "job-description4-1" : "Two-year mandate in the intergenerational committee. Participation in seminars, meetings with Isère's deputy and Meylan's mayor.",
    "job-description4-2" : "Organization of events (concerts, meetings, installation of vegetable gardens) in nursing homes for the elderly.",
    "job-description4-3" : "Tour of the national assembly and the Sénat in Paris.",




    "school-projects" : "School projects",

    "project1" : "Modelisation of Monte Carlo's method",
    "project-timeline1" : "December 2021 (1 month, solo work)",
    "project-description1-1" : "Computation of pi's approximation using Monte Carlo's method with the given parameters in the command line.",
    "project-description1-2" : "Generation of an animated image (GIF) showing the evolution of pi's approximation, using .ppm images format (each pixel is given an RGB code). The writing of each approximation is done with a 7-segment display for each digit that changes the pixel in black.",
    "project-description1-3" : "This project built from scratch helped me work on python and on optimization using various data structures (dictionnary, iterators, tables, etc).",

    "project2" : "Library for graphical interfaces",
    "project-timeline2" : "May 2022 (3 weeks, in team of 3 students)",
    "project-description2-1" : "Library coded entirely in C, similar to tkinter in python. Can be used to build simple games or applications.",
    "project-description2-2" : "Uses the concept of widgets (buttons, frames, toplevels) and geometry managers to place elements on the screen. The library handles the addition of new types of widgets or geometry managers by the user.",
    "project-description2-3" : "This project enabled me to manipulate many aspects of programmation such as event programming or polymorphism in C structures (used for object-oriented programming). It really helped me enhance my level in C as a huge part of the project consisted in debugging, finding memory errors and leaks and optimizing the code to gain fluidity when moving the top levels.",


    "personal-projects" : "Personal projects",
    "project3" : "This website!",
    "project-timeline3" : "Since June 2022",
    "project-description3-1" : "Small website built from scratch to present my CV and my projects.",
    "project-description3-2" : "Symbolizes my first step into the web programming world. I learned the very basics of HTML, CSS and a little bit of Javascript (essentially for the menu, the translations between French and English).",
    "project-description3-3" : "This project is in constant amelioration as I'm learning by myself when I find time. I hope you enjoy it!",

    "project4":"Raycaster (using the SDL2 library)",
    "project-timeline4":" August 2022 - September 2022",
    "project-description4-1":"Graphical interface built from scratch allowing the user to cast light (rays) on edges and curves.",
    "project-description4-2":"The user can draw curves by placing points on the screen. Each fragment of curve drawn correspond to a cubic Bézier curve which is connected to the following curve with a C² junction. Therefore, the global curve (made of all the fragments) drown actually represents a spline. It is possible to draw several splines on the screen by switching to another button of the panel and going back to the 'Curves' button.",
    "project-description4-3":"It is also possible to move the curve and change its appearance by sliding the white point (see examples below).",
    "project-description4-4":"The number of rays displayed in the screen can be set up to 3000 using only edges, and up to 250 using Bézier curves.",
    "project-description4-5":"This project allowed me to apply directly my mathematical knowledge (regarding geometry modeling) to a concrete project. It also enabled me to work again on evenemential programming, optimization and other aspects of programming.",

    "project5":"My first shader",
    "project-timeline5":"End of October 2022 - Now",
    "project-description5-1":"Description incoming..."
}
