{
    "experience" : "Expérience",
    "projects" : "Projets",

    "aboutme" : "A propos de moi",
    "aboutme-ph1" : "Je suis étudiante en deuxième année d'école d'ingénieurs à l'ENSIMAG (École Nationale Supérieure d'Informatique et de Mathématiques Appliquées de Grenoble). Mes cours sont principalement liés à la modélisation 3D, la simulation ainsi que le rendu d'objets en temps réel.",
    "aboutme-ph2" : "Lorsque je ne suis pas en cours, j'aime travailler sur des projets personnels qui challengent mon intellect. Surtout lorsqu'il s'agit de projets impliquant une partie artistique ou mathématique je deviens davantage curieuse, j'ai toujours envie d'en apprendre plus, même dans des domaines qui me sont complètement inconnus.",
    "aboutme-ph3" : "Dernièrement je me suis penchée sur la programmation web en créant ce site et en l'améliorant au fur et à mesure, puis j'ai entrepris la création d'un raycaster en C. À l'heure actuelle, j'apprends le GLSL par moi-même afin de pouvoir créer mes propres shaders. J'apprends également le Rust et à utiliser OpenGL car j'ai pour objectif de créer un jeu multi-joueurs en 3D à partir de rien (y compris le moteur de jeu) avec deux amis à partir de février 2023, dans le cadre d'un projet de cours proposé par nous. Ma connaissance du GLSL combinée avec OpenGL me permettra de créer des shaders que je pourrai incorporer dans le jeu.",
    "aboutme-ph4" : "Enfin, lorsque je ne programme pas, vous me trouverez probablement sur un mur d'escalade avec mes amis (il y a de vraiment bon spots de grimpe autour de Grenoble !). J'ai également beaucoup d'appétence pour le dessin et la musique ainsi que les jeux vidéos (je joue principalement à Terraria, j'adore ce jeu !). N'hésitez pas à visiter la section Éducation si cela vous intéresse !",
    "contact" : "Envie d'en apprendre plus ? N'hésitez pas à me contacter !",

    "schooling" : "Scolarité",

    "location1":"Ecole nationale d'Informatique et de Mathématiques Appliquées (ENSIMAG), Grenoble",
    "timeline1" : "Depuis septembre 2021",
    "diploma1" : "Diplôme d'ingénieurs en informatique et mathématiques appliquées",
    "description1-1" : "Ecole d'ingénieurs en 3 ans spécialisée en informatique et mathématiques appliquées.",
    "description1-2" : "Spécialité : modélisation 3D, la simulation, l'imagerie ainsi que la sécurité informatique.",

    "location2" : "Grenoble, France",
    "timeline2" : "Septembre 2019 - Juin 2021",
    "diploma2" : "Classe préparatoire intégrée aux écoles du groupe INP (Instituts Nationaux Polytechniques) : La Prépa des INP",
    "ranking" : "Major de promotion sur toutes les Prépas des INP de France.",
    "description2" : "Classe préparatoire aux écoles d'ingénieurs en 2 ans avec des cours intensifs en mathématiques, informatique, physique et chimie.",

    "location3":"Lycée du Grésivaudan, Grenoble",
    "timeline3" : "Septembre 2016 - Juin 2019",
    "diploma3" : "Baccalauréat, félicitations du jury(19,18/20)",
    "description3-1" : "Cours principalement reliés aux sciences (mathématiques, physique, chimie, biologie).",
    "description3-2" : "Projet de seconde année (TPE) sur l'étude et l'amélioration du vol des avions en papier.",

    "other-education" : "Loisirs",

    "title4" : "Apprentissage de la guitare en autodidacte",
    "timeline4" : "Depuis 2018",
    "description4-1" : "Apprentissage via des tutoriels, vidéos sur youtube et revues sur internet.",
    "description4-2" : "Pas de reproduction sur scène à ce jour...",

    "location5" : "Conservatoire à Rayonnement Communal (CRC) de Meylan",
    "timeline5" : "2007-2017",
    "diploma5" : "Brevet musical de deuxième cycle (sur trois) en clarinette.",
    "description5-1" : "Cours de pratique musicale en clarinette et cours de solfège.",
    "description5-2" : "J'ai eu l'opportunité de rejoindre un orchestre nommé Bo.Per.Cui en 2015 qui m'a permis de participer à de nombreux concerts (en France et en Allemagne). Ce fut une expérience enrichissante car j'ai pu rencontrer de nouvelles personnes et découvrir une autre culture.",

    "title6":"Dessin",
    "timeline6":"Depuis que je sais tenir un crayon !",
    "description6-1":"Voici quelques dessins réalisés ces dernières années. Je n'utilise que des crayons avec des mines différentes en fonction du niveau de détails dont j'ai besoin (ombres, traits du visage...).",
    "description6-2":"J'ai appris à dessiner par moi-même lorsque j'étais petite principalement en essayant de recopier des images que j'avais prises auparavant ou en essayant de dessiner des objets dans ma chambre. Aussi loin que je me souviens, j'ai toujours apprécié l'idée de reproduire la réalité dans ses plus fins détails.",
    "description6-3":"En grandissant, j'ai commencé à inventer des personnages et à les dessiner (certains d'entre eux correspondent probablement inconsciemment à un mix de personnes que j'ai pu croiser dans ma journée...).",

    "pro-experiences" : "Expériences professionnelles",

    "job1" : "Vendeuse",
    "job-timeline1" : "18 juillet 2022 - 8 août 2022 (3 semaines)",
    "job-location1":"IKEA Grenoble",
    "job-description1-1" : "Première expérience professionnelle dans une multinationale." ,
    "job-description1-2" : "Mon travail principal était de répondre aux demandes et questionnements des clients.",
    "job-description1-3" : "Je devais aussi m'occuper du restockage des rayons et de leur maintenance (arrosage des plantes, rangement des étagères...).",
    "job-description1-4" : "Ce travail m'a vraiment permis de gagner en confiance car je devais prendre des initiatives toute seule devant les clients et je devais surtout m'exprimer correctement. Ce job m'a appris à être responsable au travail, à bien me comporter au sein d'une entreprise avec un règlement strict ainsi qu'avec mes collègues et les clients.",

    "job2" : "Tutrice",
    "job-timeline2" : "Novembre 2021 - Mars 2022 (4 mois)",
    "job-location2" : "La Prépa des INP, Saint-Martin-d'Hères",
    "job-description2-1" : "Dispense de cours en mathématiques, physique et chimie à deux étudiants de première année en difficultés.",
    "job-description2-2" : "Chaque cours était divisé en plusieurs moments-clés. Les élèves pouvaient tout d'abord poser des questions sur des difficultés qu'ils avaient dans certaines matières ou dans leur organisation pour travailler. Cela permettait de définir ce qu'on allait travailler aux séances suivantes. Ensuite, nous passions le reste du cours à reviser le cours et faire de nouveaux exercices que j'avais créés pour eux.",

    "job3" : "Stage ouvrier",
    "job-timeline3" : "Mai 2021 - Juin 2021 (6 semaines)",
    "job-location3":"LDLC, Saint-Martin-d'Hères",
    "job-description3-1" : "",
    "job-description3-2" : "Installation d'OS, montage de PC.",
    "job-description3-3" : "Prise en charge des clients en boutique (encaissement, commandes en ligne, click&collect). Restockage de l'entrepôt, rangement des rayons...",
    "job-description3-4" : "Mise à jour de certaines parties de l'inventaire.",

    "job5" : "Assistante ingénieur",
    "job-timeline5":"22 Septembre 2022 - 31 Décembre 2022 (3 mois)",
    "job-location5":"Laboratoire d’Informatique de Grenoble (LIG)",
    "job-description5-1":"Étude de la littérature scientifique pour réaliser un état de l'art des nudges existant dans le domaine numérique et visant à réduire l'impact environnemental lié à l'utilisation des technologies.",
    "job-description5-2":"Ce travail m'a permis de développer la capacité à trouver rapidement des informations pertinentes (via la recherche d'articles) en utilisant plusieurs ressources en même temps (ACM, Sci-hub, Research Gate, etc.).",
    "job-description5-3":"J'ai aussi eu l'opportunité d'apprendre à rédiger des fichiers en Markdown et à utiliser Obsidian.",

    "other-experiences" : "Autre(s) expérience(s)",
    "job4" : "Consneillère municipale des jeunes de Meylan",
    "job-timeline4" : "2010-2012 (2 ans)",
    "job-location4":"Mairie de Meylan",
    "job-description4-1" : "Mandat de 2 ans en commission intergénérationnelle. Participation à des séminaires, rencontres avec le député de l'Isère et la maire de Meylan.",
    "job-description4-2" : "Organisation d'évènements pour les personnes âgées des EHPAD (concerts, rencontres, installation de potagers...)",
    "job-description4-3" : "Visite de l'Assemblée Nationale et du Sénat à Paris.",



    "school-projects" : "Projets scolaires",

    "project1" : "Modélisation de la méthode de Monte Carlo",
    "project-timeline1" : "Décembre 2021 (1 mois, travail personnel)",
    "project-description1-1" : "Calcul d'une approximation de Pi en utilisant la méthode de Monte Carlo en fonction de paramètres rentrés en ligne de commande.",
    "project-description1-2" : "Génération d'une image animée (GIF) représentant l'évolution de l'approximation de Pi à l'aide d'images au format .ppm (chaque pixel détient un code RGB). Chaque approximation calculée est affichée avec un afficheur 7-segment qui modifie la couleur des pixels en noir.",
    "project-description1-3" : "Ce projet codé à partir de rien m'a aidé à travailler sur l'optimisation d'un programme et à utiliser des structures de données adaptées (dictionnaires, itérateurs, etc).",

    "project2" : "Librairie pour interfaces graphiques",
    "project-timeline2" : "Mai 2022 (3 semaines, en équipe de 3)",
    "project-description2-1" : "Librairie codée entièrement en C, similaire à tkinter en python. Cette dernière peut être utilisée pour construire des jeux simples ou des petites applications.",
    "project-description2-2" : "Utilise le concept de widgets (buttons, frames, toplevels) et de gestionnaire de géometrie pour placer les éléments sur l'écran. Cette librairie gère également l'ajout de nouveaux widgets et de nouveaux gestionnaires de géométrie (gridder, par exemple) par l'utilisateur.",
    "project-description2-3" : "Ce projet m'a permis de manipuler de nombreux aspects comme la programmation évènementielle, l'utilisation de polymorphismes en C dans les structures, etc. Cela m'a aussi permis d'améliorer mon niveau en C car une grosse partie de mon travail consistait à débugger, trouver des leaks et erreurs mémoires, les corriger, optimiser mon code pour gagner en fluidité et en rapidité.",


    "personal-projects" : "Projets personnels",
    "project3" : "Ce site web !",
    "project-timeline3" : "Depuis juin 2022",
    "project-description3-1" : "Petit site web construit à partir de rien pour présenter mon CV et mes projets.",
    "project-description3-2" : "Représente mon premier pas dans le monde de la programmation web. J'ai pu apprendre les bases de l'HTML, du CSS et un petit peu de Javascript pour animer mon menu et effectuer les traductions de l'anglais au français (et inversement).",
    "project-description3-3" : "Ce projet est en constante amélioration car j'apprends au fur et à mesure lorsque je trouve du temps. J'espère que vous l'appréciez !",

    "project4":"Raycaster (avec la librairie SDL2)",
    "project-timeline4":" Août 2022 - Septembre 2022",
    "project-description4-1":"Interface graphique construite à partir de rien permettant à l'utilisateur de projeter de la lumière (rayons) sur des objets de type lignes ou courbes.",
    "project-description4-2":"L'utilisateur peut dessiner des courbes en plaçant des points sur l'écran. Chaque fragment de courbe correspond à une courbe de Bézier cubique qui sera rattachée à la prochaine courbe dessinée à l'aide d'un raccordement C². Ainsi, la courbe totale représentée par tous les fragments correspond à une spline. Il est possible de dessiner plusieurs splines en cliquant sur un autre bouton du panel et en revenant sur le bouton 'Curves'.",
    "project-description4-3":"Il est également possible de modifier l'allure de chaque courbe de Bézier en déplaçant le point blanc sur l'écran (voir exemple ci-dessous).",
    "project-description4-4":"Le nombre de rayons projetés peut monter jusqu'à 3000 lorsqu'on utilise que des segments et jusqu'à 250-300 lorsqu'on ajoute des courbes de Bézier.",
    "project-description4-5":"Ce projet m'a permis d'appliquer directement mon savoir en modélisation géométrique. Il m'a permis également de revoir certains aspects de la programmation (programmation évènementielle, optimisation, etc.).",

    "project5":"SHADERS",
    "project-timeline5":"Fin octobre 2022 - Maintenant",
    "project-description5-1":"Voici un de mes premiers shaders, réalisé après une à deux semaines totales d'apprentissage (parsemées entre mes cours et mon job étudiant).",
    "project-description5-2": "Ce shader a été réalisé en utilisant du raymarching et des fBm (fractional Brownian motions) pour l'aspect 'fluide' des vagues ainsi que la forme de la terre sur le volcan. L'ajout de textures et d'une displacement map sur la terre permet de lui donner un aspect rocailleux.",
    "project-description5-3": "À noter que le framerate est assez mauvais mais car le nombre d'octaves pour le calcul des fBm est assez élevé ainsi que la distance maximale dans la fonction de raymarching.",
    "project-description5-4":"N'hésitez pas à checker mes autres shaders sur Shadertoy ! Mon identifiant est : helenhsn."
}